attacker145/NRF51822-ADC-over-BLE-link/examples/ble_peripheral/ble_app_uart/main_Rev01.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}



/**@brief Application main function.
 */
//unsigned char *uart;

int main(void)
{
		uint32_t err_code;
		uint8_t cntr = 0;
	  connected = 1;		
    bool 		erase_bonds;	
						
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();
    
    buttons_leds_init(&erase_bonds);
		ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
					
		nrf_delay_ms(10);
							
    printf("\r\nUART Start!\r\n");				 
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
#ifdef adc
		adc_config();
#endif										
		cntr = 0;
		// The main loop.
    for (;;)
    {								
				if(connected){

#ifdef adc			
					APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));   //Allocate buffer for ADC
					for (uint32_t i = 0; i < ADC_BUFFER_SIZE; i++)
					{
						nrf_drv_adc_sample();           // manually trigger ADC conversion
						power_manage();                 // CPU enter sleep mode during sampling. CPU will be enabled again when ADC interrupt occurs and adc_event_handler is called
						LEDS_INVERT(BSP_LED_1_MASK);    // Indicate sampling complete
						nrf_delay_ms(250);              // Slow down sampling frequency with 250ms blocking delay
					}
#endif																																			
					if (cntr <255)
						cntr++;
					else
						cntr =0;
				}
				else{	// Idle								
					LEDS_OFF(BSP_LED_0_MASK);
					LEDS_OFF(BSP_LED_1_MASK);
					LEDS_OFF(BSP_LED_2_MASK);
					LEDS_OFF(BSP_LED_3_MASK);
					nrf_gpio_pin_clear(22);					// RESET pin low
					nrf_gpio_pin_clear(21);					// START pin low
									
					spi_tx_buff_ptr = adc_sleep;		// Initialize pointer to read register buffer	
					// Reset rx buffer and transfer done flag
					memset(m_rx_buf, 0, m_length_sleep);				
					spi_xfer_done = false;			
					APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, m_length_sleep, m_rx_buf, m_length_sleep));
					//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, read_reg, length_read_reg, m_rx_buf, length_read_reg));
					while (!spi_xfer_done)
					{
						__WFE();
					}	
					
					sleep_mode_enter();
					//power_manage();				
					//__SEV();
					//__WFE();
					//__WFE();								
				}
					
					
					
			}	
}


/** 
 * @}
 */

